In [1]:
#importing required libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns
import warnings
warnings.filterwarnings('ignore')

In [37]:

# create empty list
df_list = []
def reading_list_of_datasets(arr):  
    # append datasets into the list
    for i in range(len(arr)):
        temp_df = pd.read_csv("./"+arr[i]+".csv")
        df_list.append(temp_df)
    return df_list

In [ ]:
features_df = pd.read_csv('./Features data set.csv')
sales_df = pd.read_csv('./sales data-set.csv')
stores_df = pd.read_csv('./stores data-set.csv')

In [38]:
data = ['Features data set','sales data-set', 'stores data-set']
#importing csv or excel file
reading_list_of_datasets(data)

In [39]:
df_list[0].head())

SyntaxError: unmatched ')' (2263387136.py, line 1)

### Exploring the data sets

In [17]:
#exploring the data
features_df.head()

NameError: name 'datasets' is not defined

In [5]:
sales_df.head()

   Store  Dept        Date  Weekly_Sales  IsHoliday
0      1     1  05/02/2010      24924.50      False
1      1     1  12/02/2010      46039.49       True
2      1     1  19/02/2010      41595.55      False
3      1     1  26/02/2010      19403.54      False
4      1     1  05/03/2010      21827.90      False

In [6]:
stores_df.head()

   Store Type    Size
0      1    A  151315
1      2    A  202307
2      3    B   37392
3      4    A  205863
4      5    B   34875

In [7]:
features_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8190 entries, 0 to 8189
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Store         8190 non-null   int64
 1   Date          8190 non-null   object
 2   Temperature   8190 non-null   float64
 3   Fuel_Price    8190 non-null   float64
 4   MarkDown1     4032 non-null   float64
 5   MarkDown2     2921 non-null   float64
 6   MarkDown3     3613 non-null   float64
 7   MarkDown4     3464 non-null   float64
 8   MarkDown5     4050 non-null   float64
 9   CPI           7605 non-null   float64
 10  Unemployment  7605 non-null   float64
 11  IsHoliday     8190 non-null   bool
dtypes: bool(1), float64(9), int64(1), object(1)
memory usage: 712.0+ KB

In [8]:
def nun_missing_values(df):
    total_missing = df.isnull().sum()
    total_missing = total_missing[total_missing > 0]
    total_missing.sort_values(inplace=True)
    return total_missing

In [9]:
nun_missing_values(features_df) #no missing values in the features data set

CPI              585
Unemployment     585
MarkDown5       4140
MarkDown1       4158
MarkDown3       4577
MarkDown4       4726
MarkDown2       5269
dtype: int64

In [10]:
#returning the dataframe with the nun columns dropped
def drop_nun_columns_more_than_50_percent_missing(df):
    nun_columns = df.isnull().sum()
    nun_columns = nun_columns[nun_columns > len(df) * 0.5]
    nun_columns.sort_values(inplace=True)
    df.drop(nun_columns.index, axis=1, inplace=True)
    return df

In [11]:
drop_nun_columns_more_than_50_percent_missing(features_df)

,Store,Date,Temperature,Fuel_Price,CPI,Unemployment,IsHoliday
0,1,05/02/2010,42.31,2.572,211.096358,8.106,False
1,1,12/02/2010,38.51,2.548,211.242170,8.106,True
2,1,19/02/2010,39.93,2.514,211.289143,8.106,False
3,1,26/02/2010,46.63,2.561,211.319643,8.106,False
4,1,05/03/2010,46.50,2.625,211.350143,8.106,False
...,...,...,...,...,...,...,...
8185,45,28/06/2013,76.05,3.639,NaN,NaN,False
8186,45,05/07/2013,77.50,3.614,NaN,NaN,False
8187,45,12/07/2013,79.37,3.614,NaN,NaN,False
8188,45,19/07/2013,82.84,3.737,NaN,NaN,False
8189,45,26/07/2013,76.06,3.804,NaN,NaN,False